In [59]:
import numpy as np
import pandas as pd
import re
# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Librerías de visualización
# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
#Importamos csv
df=pd.read_csv('HR RAW DATA.csv')
df.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [4]:
#Creamos nueva variable para guardar la selección del rango de columnas que queremos.
#Este será nuestro csv
df_data=df.iloc[:, 1:]
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [5]:
#Visualizamos la información básica del DataFram
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 517.1+ KB

In [6]:
#Exportamos el csv
df_data.to_csv('hr_data.csv', index=False)

In [7]:
#celda marga
#Seleccionamos celdadas - enviroment satisfaction-monthly rates 
#a traves, de df.info, tenemos información sobre las columnas:
df_columnas_parte_2=df_data.loc[:, 'EnvironmentSatisfaction':'MonthlyRate']
df_columnas_parte_2

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
0,1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462
1,3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678
2,3,0,58,3,5,ManaGER,4,Married,"19232,0",4933
3,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703
4,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739
...,...,...,...,...,...,...,...,...,...,...
1609,3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518
1610,3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163
1611,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560
1612,1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952
1613,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208

LIMPIEZA DE COLUMNAS:

In [7]:
#sACAMOS INFORMACION DE LOS VALORES UNICOS Y TIPO QUE TIENE CADA COLUMNA
for columna in df_columnas_parte_2.columns:#iteramos por cada columna
    print(f'Para la columna :',columna)
    print(f"valores unicos : \n{df_columnas_parte_2[columna].value_counts()}\n")#obtenemos la frecuencia de los valores unicos
    
    print('-----------------------------------------------')

Para la columna : EnvironmentSatisfaction
valores unicos :
EnvironmentSatisfaction
4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: count, dtype: int64

-----------------------------------------------
Para la columna : Gender
valores unicos :
Gender
0    971
1    643
Name: count, dtype: int64

-----------------------------------------------
Para la columna : HourlyRate
valores unicos :
HourlyRate
Not Available    84
42               33
66               32
48               30
57               29
                 ..
47               15
53               13
68               13
38               12
34               11
Name: count, Length: 72, dtype: int64

-----------------------------------------------
Para la columna : JobInvolvement
valores unicos :
JobInvolvement
3    955
2    406
4    164
1     89
Name: count, dtype: int64

-----------------------------------------------
Para la columna : JobLevel
valores unicos :
JobLevel
2    597
1    586
3    242
4    113
5     76
Name: count, dtype: int64

-----------------------------------------------
Para la columna : JobRole
valores unicos :
JobRole
 mANager                       4
 ManageR                       3
 ManagEr                       3
 mAnaGeR                       3
 MANAgER                       3
                              ..
 ResEArch ScieNTiST            1
 HealthcARE RePreSENtAtiVe     1
 ReSearcH scIEntist            1
 LAbOrATOry techNicIan         1
 mAnUfactURInG DiRECTOr        1
Name: count, Length: 1579, dtype: int64

-----------------------------------------------
Para la columna : JobSatisfaction
valores unicos :
JobSatisfaction
4    514
3    481
1    317
2    302
Name: count, dtype: int64

-----------------------------------------------
Para la columna : MaritalStatus
valores unicos :
MaritalStatus
Married     404
Single      325
Divorced    188
Marreid      35
divorced     11
Name: count, dtype: int64

-----------------------------------------------
Para la columna : MonthlyIncome
valores unicos :
MonthlyIncome
6347,0     4
5304,0     4
2657,0     3
2258,0     3
5405,0     2
          ..
3102,0     1
4556,0     1
4230,0     1
4859,0     1
19431,0    1
Name: count, Length: 668, dtype: int64

-----------------------------------------------
Para la columna : MonthlyRate
valores unicos :
MonthlyRate
9150     4
11737    3
17001    3
6069     3
21981    3
        ..
25470    1
10205    1
9973     1
17089    1
16642    1
Name: count, Length: 1427, dtype: int64

-----------------------------------------------

### EnvironmentSatisfaction

Por definicion tiene que ser del 1-4.
Hay valores fuera del rango. Hacemos un estudio de los mismos:
- estan comprendidos entre 12-43. 
- con respecto al resto de frecuencuias, estos valores presentan frecuencias muy bajos del 1-7 comparado con los 200-400 de los otros.

Solución:
- valorar poner estos valores como nulos
- extrapolar los valores en funcion de si estan comprendidos entre 10-20 (1),20-30 (2), 30-40(3), 40-50(4). calculamos las medias y observamos si hay variaciones significativas.

In [8]:
"""Transformamos los datos comprendidos entre 10-50 en NULOS"""
#Seleccionamos este rango de valores :
df_envst_error=df_columnas_parte_2[df_columnas_parte_2['EnvironmentSatisfaction'].between(10,50,inclusive='both')]
df_envst_error.head(2)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
24,42,0,56,3,2,SALEs exeCUtIVe,4,NaN,"6201,0",2823
30,37,1,81,3,3,Sales ExECuTIVe,3,Divorced,"10447,0",26458

In [9]:
df_columnas_parte_2['EnvironmentSatisfaction']

0        1
1        3
2        3
3        1
4        1
        ..
1609     3
1610     3
1611    13
1612     1
1613     4
Name: EnvironmentSatisfaction, Length: 1614, dtype: int64

In [10]:
df_columnas_parte_2_copy1=df_columnas_parte_2.copy() #hacemos una copia

Opcion 1:

In [11]:
#usamos el metodo aply para transformar los datos en nulos.

#definimos una funcion:
def change_to_null(valor):
    if 10<=valor<=50:
        return np.nan #devolvemos un np.nan(valor Not a Number)
    else:
        return valor

In [13]:
df_columnas_parte_2_copy1['EnvironmentSatisfaction']=df_columnas_parte_2_copy1['EnvironmentSatisfaction'].apply(change_to_null)

In [14]:
#comprobamos que han desparecido los valores más dispares:
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4.0    460
3.0    459
1.0    298
2.0    297
Name: count, dtype: int64

In [15]:
#comprobamos cuantos valores tenemos nulos:
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].isnull().sum()

100

Opcion 2:

In [20]:
df_columnas_parte_2_copy1.head(2)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
0,1.0,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462
1,3.0,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678

In [21]:
# es valor int. Sin embargo, me da decimales.

In [35]:
"""Transformamos los datos comprendidos entre 10-50 en valores comprendidos en el rango seleccionado"""
df_columnas_parte_2_copy2=df_columnas_parte_2.copy()

In [53]:
#usamos el metodo aply para transformar los datos en nulos.

#definimos una funcion:
def extrapolate(valor):
    if 4>=valor:
        return valor
    elif 4<valor<=10:
        return 1
    elif 10<valor<20:
        return 2
    elif 20<valor<30:
        return 3
    elif 30<valor<40:
        return
    elif valor>40:
        return 4

In [54]:
#aplicamos la funcion anterior a la columna 'EnvironmentS'
df_columnas_parte_2_copy2['EnvironmentSatisfaction']=df_columnas_parte_2_copy2['EnvironmentSatisfaction'].apply(extrapolate)

In [55]:
#antes de pasar los datos a tipo int, nos aseguramos de que no hay valores tipo Nan
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].isnull().sum()

21

In [58]:
#Evaluamos la informacion estadistica para ver la mejor opción para manejar los duplicados
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].describe()

count    1593.000000
mean        2.723164
std         1.088691
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         4.000000
Name: EnvironmentSatisfaction, dtype: float64

In [64]:
#manejamos los nulos:
#Al ser 21/1614 nulos usamos simple imputer(). Comparando la media y la mediana vemos que no hay mucha diferencia por lo que usaremos la media para rellenar los valores nulos.
imputer=SimpleImputer(strategy='mean')
df_columnas_parte_2_copy2['EnvironmentSatisfaction']=imputer.fit_transform(df_columnas_parte_2_copy2[['EnvironmentSatisfaction']])

In [65]:
#comprobamos:
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].isnull().sum()

0

In [66]:
#Sin nulos, procedemos  acambiar el tipo de variable:
df_columnas_parte_2_copy2['EnvironmentSatisfaction']=df_columnas_parte_2_copy2['EnvironmentSatisfaction'].astype('int64')

In [67]:
df_columnas_parte_2_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EnvironmentSatisfaction  1614 non-null   int64
 1   Gender                   1614 non-null   int64
 2   HourlyRate               1614 non-null   object
 3   JobInvolvement           1614 non-null   int64
 4   JobLevel                 1614 non-null   int64
 5   JobRole                  1614 non-null   object
 6   JobSatisfaction          1614 non-null   int64
 7   MaritalStatus            963 non-null    object
 8   MonthlyIncome            771 non-null    object
 9   MonthlyRate              1614 non-null   int64
dtypes: int64(6), object(4)
memory usage: 126.2+ KB

In [46]:
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4.0    486
3.0    478
2.0    331
1.0    298
Name: count, dtype: int64

In [68]:
#comprobamos que se han aplicado los cambios en la columna:
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4    486
3    478
2    352
1    298
Name: count, dtype: int64

In [23]:
#sacmos los valores estadisticos para ver la influencia de los diferentes metodos
#para la opcion 2, de asignar valores a aquellos que estaban más desviados. un 10% de los datos:
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].describe()

count    1614.000000
mean        4.294919
std         6.993559
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        49.000000
Name: EnvironmentSatisfaction, dtype: float64

In [24]:
#para la opcion 1, pasar los valores desviados a nulos.
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].describe()

count    1514.000000
mean        2.714003
std         1.098326
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         4.000000
Name: EnvironmentSatisfaction, dtype: float64

In [25]:
#datos inicales de la columna, sin transformar.
df_columnas_parte_2['EnvironmentSatisfaction'].describe()

count    1614.000000
mean        4.294919
std         6.993559
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        49.000000
Name: EnvironmentSatisfaction, dtype: float64

 conclusion:
 Los valores medios  con la opcion 2 se mantienen proxims
 Los valores  unicos tampoco varian significativamente si extrapolamos los datos.

### Age
Transformamos los valores 0 en m (male) y 1 en f(female)

In [27]:
# lo primero que vamos a hacer es crear un diccionario donde:
# las claves sean los valores que tenemos en la columna sobre la que queremos aplicar el map
# los valores del diccionario serán los valores nuevos que queremos tener en la columna
# En nuestro caso queremos reemplazar los 0 por m y los 1 por f
dicc_map = {0: "male", 1: "female"}

In [69]:
df_columnas_parte_2_copy2['Gender'] = df_columnas_parte_2_copy2['Gender'] .map(dicc_map)
df_columnas_parte_2_copy2.sample(4)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
555,4,male,45,3,2,ReseARch SciENTISt,2,Divorced,NaN,25518
368,1,male,41,4,3,saLEs exEcUTIVe,3,Single,NaN,2560
745,4,female,59,4,4,mANUfaCtURing DIReCTOr,3,Married,NaN,9731
1264,4,female,75,3,3,mAnageR,4,Single,"13591,0",14674

In [70]:
#Sacamos los valores nulos
df_columnas_parte_2_copy2['Gender'].isnull().sum()

0

In [72]:
#pasamos los valores a tipo object:
df_columnas_parte_2_copy2['Gender']=df_columnas_parte_2_copy2['Gender'].astype('object')

In [73]:
#comprobamos si se ha hecho el cambio:
df_columnas_parte_2_copy2.dtypes

EnvironmentSatisfaction     int64
Gender                     object
HourlyRate                 object
JobInvolvement              int64
JobLevel                    int64
JobRole                    object
JobSatisfaction             int64
MaritalStatus              object
MonthlyIncome              object
MonthlyRate                 int64
dtype: object

### HoulyRate
Observamos que dentro de sus valores unicos hay varios 'not available'
Solucion: aplicar gestion de errores y comparar su influencia con las medias.
cambiar tipo de dato a float

In [74]:
df_columnas_parte_2_copy2['HourlyRate'].value_counts()

HourlyRate
Not Available    84
42               33
66               32
48               30
57               29
                 ..
47               15
53               13
68               13
38               12
34               11
Name: count, Length: 72, dtype: int64

In [75]:
#Para poder operar con la media y transformalos en float, es necesario pasar el 'not available' a valores nulo nan:
def change_to_null1 (string):
    if string == 'Not Available':
        return np.nan
    else:
        return string

In [76]:
#aplicamos la funcion anterior
df_columnas_parte_2_copy2['HourlyRate']=df_columnas_parte_2_copy2['HourlyRate'].apply(change_to_null1)

In [82]:
#observamos los valores unicos para confirmar el cambio:
df_columnas_parte_2_copy2['HourlyRate'].unique()

array(['51', '65', '58', '82', '45', '99', '91', '64', '55', '68', '49',
       '61', '79', '31', '69', '48', '80', '74', '98', '59', '33', '56',
       '66', '57', '53', '87', '81', '84', '32', '41', '92', '47', nan,
       '43', '86', '30', '42', '88', '96', '67', '62', '72', '78', '89',
       '52', '50', '90', '37', '94', '76', '60', '46', '83', '100', '40',
       '97', '54', '75', '39', '85', '63', '44', '93', '36', '35', '73',
       '71', '70', '38', '77', '95', '34'], dtype=object)

In [83]:
#comprobamos si el numero de nulos coincide con el numero de 'not available'
df_columnas_parte_2_copy2['HourlyRate'].isnull().sum()

84

conclusion:
Hay 84/1614 valores nulos. 
Habria que estudiar el por qué estos valores son nulos. si el trabajador se encuentra en plantilla y esta en activo--------> aplicar gestion de errores IterativeImputer o KNNImputer

In [87]:
#revisamos los valores:
df_columnas_parte_2_copy2['HourlyRate'].sample(15)

118      99
418      86
217      56
492      62
1312    NaN
249      92
605      42
923      71
401     NaN
1469     31
734      49
455      65
1076     90
1414     93
170      37
Name: HourlyRate, dtype: object

In [88]:
df_columnas_parte_2_copy2['HourlyRate'].value_counts()

HourlyRate
42    33
66    32
48    30
84    29
57    29
      ..
47    15
68    13
53    13
38    12
34    11
Name: count, Length: 71, dtype: int64

In [90]:
#observamos que no los valores tienen una frecuencia alta n por lo que el mejor método es KNNImputer:
imputer_knn= KNNImputer(n_neighbors=5)
df_columnas_parte_2_copy2['HourlyRate']=imputer_knn.fit_transform(df_columnas_parte_2_copy2[['HourlyRate']])

In [91]:
df_columnas_parte_2_copy2['HourlyRate'].isnull().sum()

0

In [92]:
df_columnas_parte_2_copy2['HourlyRate'].describe()

count    1614.000000
mean       66.028105
std        19.653316
min        30.000000
25%        49.000000
50%        66.028105
75%        83.000000
max       100.000000
Name: HourlyRate, dtype: float64

### Job Role
Debemos cambiar todo a minusculas.

In [113]:
df_columnas_parte_2_copy2['JobRole']=df_columnas_parte_2_copy2['JobRole'].str.lower()

In [114]:
df_columnas_parte_2_copy2['JobRole'].value_counts()

JobRole
 sales executive               369
 research scientist            314
 laboratory technician         278
 manufacturing director        158
 healthcare representative     149
 manager                       111
 sales representative           90
 research director              88
 human resources                57
Name: count, dtype: int64

In [95]:
df_columnas_parte_2_copy2['JobRole'].dtypes

dtype('O')

### MaritalStatus
corregimos errores de ortografia

In [99]:
#quitamos mayusculas:
df_columnas_parte_2_copy2['MaritalStatus']=df_columnas_parte_2_copy2['MaritalStatus'].str.lower()

In [100]:
#usamos el metodo replace:
df_columnas_parte_2_copy2['MaritalStatus']=df_columnas_parte_2_copy2['MaritalStatus'].replace('marreid','married')

In [101]:
#sacamos los valores unicos:
df_columnas_parte_2_copy2['MaritalStatus'].unique()

array([nan, 'married', 'divorced', 'single'], dtype=object)

In [ ]:
#observamos que hay valores nulos:

In [102]:
df_columnas_parte_2_copy3['MaritalStatus'].isnull().sum()

651

conclusion:
Hay 651/1614 nulos. Sustituir variable por una string

### Monthly income/MonthlyRate
Ambas cplumnas tenemos que cambiarlas al tipo float y cambiar',' por '.'

In [103]:
df_columnas_parte_2_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EnvironmentSatisfaction  1614 non-null   int64
 1   Gender                   1614 non-null   object
 2   HourlyRate               1614 non-null   float64
 3   JobInvolvement           1614 non-null   int64
 4   JobLevel                 1614 non-null   int64
 5   JobRole                  1614 non-null   object
 6   JobSatisfaction          1614 non-null   int64
 7   MaritalStatus            963 non-null    object
 8   MonthlyIncome            771 non-null    object
 9   MonthlyRate              1614 non-null   int64
dtypes: float64(1), int64(5), object(4)
memory usage: 126.2+ KB

In [104]:
#al tratarse de valores tipo object, aplicamos el metodo para modificar strings:
df_columnas_parte_2_copy2['MonthlyIncome']=df_columnas_parte_2_copy2['MonthlyIncome'].str.replace(",", ".")

In [105]:
#Cambiamos el tipo de valor 
df_columnas_parte_2_copy2['MonthlyIncome']=df_columnas_parte_2_copy2['MonthlyIncome'].astype('float64')

In [108]:
#comprobamos
df_columnas_parte_2_copy2['MonthlyIncome'].value_counts()

MonthlyIncome
6347.0     4
5304.0     4
2657.0     3
2258.0     3
5405.0     2
          ..
3102.0     1
4556.0     1
4230.0     1
4859.0     1
19431.0    1
Name: count, Length: 668, dtype: int64

In [110]:
#sacamos los valores nulos
df_columnas_parte_2_copy2['MonthlyIncome'].isnull().sum()

843

In [111]:
df_columnas_parte_2_copy2['MonthlyIncome'].describe()

count      771.000000
mean      6477.686122
std       4766.119959
min       1009.000000
25%       2880.000000
50%       4859.000000
75%       8230.500000
max      19999.000000
Name: MonthlyIncome, dtype: float64

La mitad de los valores de esta columna son nulos. Valorar eliminar esta columna.
Para tratar los valores nulos, usar IterativeImputer.

In [112]:
df_columnas_parte_2_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EnvironmentSatisfaction  1614 non-null   int64
 1   Gender                   1614 non-null   object
 2   HourlyRate               1614 non-null   float64
 3   JobInvolvement           1614 non-null   int64
 4   JobLevel                 1614 non-null   int64
 5   JobRole                  1614 non-null   object
 6   JobSatisfaction          1614 non-null   int64
 7   MaritalStatus            963 non-null    object
 8   MonthlyIncome            771 non-null    float64
 9   MonthlyRate              1614 non-null   int64
dtypes: float64(2), int64(5), object(3)
memory usage: 126.2+ KB

In [109]:
df_columnas_parte_2_copy2.sample(10)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
1164,3,male,80.0,3,2,healthcare representative,3,NaN,NaN,24594
44,4,female,74.0,2,2,research scientist,1,divorced,4615.0,21029
1294,2,female,78.0,2,2,laboratory technician,3,married,3448.0,13436
411,2,male,64.0,3,3,sales executive,2,single,NaN,21534
1009,4,female,92.0,3,5,manager,1,divorced,NaN,18575
476,3,female,40.0,3,3,research director,3,married,NaN,26862
796,2,male,82.0,4,2,laboratory technician,3,NaN,4404.0,10228
1537,3,female,74.0,3,2,healthcare representative,3,NaN,NaN,2227
1484,1,male,57.0,3,1,research scientist,1,married,2042.0,15346
509,4,female,44.0,3,1,human resources,1,NaN,NaN,22957

### MonthlyRate
Pasamos los valores a tipo float

In [115]:
#Cambiamos el tipo de valor 
df_columnas_parte_2_copy2['MonthlyRate']=df_columnas_parte_2_copy2['MonthlyRate'].astype('float64')

In [116]:
#sacmos los valores nulos:
df_columnas_parte_2_copy2['MonthlyRate'].isnull().sum()

0

### Resto columnas

Revisamos los valores nulos en las columnas restantes que no necesitan limpieza:

In [119]:
lista_columnas=['JobInvolvement','JobLevel','JobSatisfaction']
for i in lista_columnas:
    print(f'Para la columna: {i}')
    print(f'valores nulos: {df_columnas_parte_2_copy2[i].isnull().sum()}')

Para la columna: JobInvolvement
valores nulos: 0
Para la columna: JobLevel
valores nulos: 0
Para la columna: JobSatisfaction
valores nulos: 0

No hay valores nulos.

### lIMPIAR NOMBRE DE COLUMNAS :

In [ ]:
colum_limpias=[]
for columna in df_columnas_parte_2:
    patron='[A-Z][^A-Z]*'
    columna_limpia=re.findall(patron,columna)
    columna_limpia1='_'.join(columna_limpia)
    columna_min=columna_limpia1.lower()
    colum_limpias.append(columna_min)
colum_limpias

In [ ]:
#Hay datos nulos?

In [ ]:
#INFOPRMACION QUE NOS INTERESA CAMBIAR:

In [ ]:
#celda sharon

In [6]:
#celda isa
df_col_3=df_data.iloc[:, 20:30]
df_col_3

,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5
1,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5
2,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3
3,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2
4,2,Y,No,12,"3,0",4,NaN,1,NaN,5
...,...,...,...,...,...,...,...,...,...,...
1609,1,Y,NaN,11,NaN,1,NaN,1,NaN,6
1610,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5
1611,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3
1612,4,NaN,No,13,NaN,4,NaN,2,"12,0",3
1613,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3

In [7]:
#Veo la info de cada columna
df_col_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   NUMCOMPANIESWORKED        1614 non-null   int64
 1   Over18                    713 non-null    object
 2   OverTime                  938 non-null    object
 3   PercentSalaryHike         1614 non-null   int64
 4   PerformanceRating         1419 non-null   object
 5   RelationshipSatisfaction  1614 non-null   int64
 6   StandardHours             419 non-null    object
 7   StockOptionLevel          1614 non-null   int64
 8   TOTALWORKINGYEARS         1088 non-null   object
 9   TrainingTimesLastYear     1614 non-null   int64
dtypes: int64(5), object(5)
memory usage: 126.2+ KB

1. Estandarizamos los nombres de las columnas

In [12]:
#Quitamos espacios en blanco, en caso de que los haya
#Utilizamos str.replace() para asegurarnos que se eliminan los espacios entre palabras, de haberlos.

#1. Creamos lista con los nuevos nombres de las columnas
#2. Iteramos las columnas del df
new_columns=[i.replace(' ', '') for i in df_col_3.columns]
#3. Asignamos los nuevos nombres de columnas al df
df_col_3.columns=new_columns

In [13]:
# 🗑️
#Visualizamos para ver que salió bien
df_col_3.head(1)

,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5

In [15]:
#Pasamos todo a minúsculas
new_columns2=[i.lower() for i in df_col_3.columns]
df_col_3.columns=new_columns2

In [16]:
# 🗑️
#Visualizamos para ver que salió bien
df_col_3.head(1)

,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5

In [ ]:
#celda silvia

In [6]:
#celda lidia


#Seleccionamos los 10 primeros
df_col_1=df.iloc[:, 0:11]

In [7]:
df_col_1

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0"
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0"
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0"
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0"
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0"
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0"
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN

In [ ]:
#VEmos valores unicos 
df_col_1["employeenumber"].unique()

In [ ]:
# otra manera de cambiar los nombres de las columnas.  porque no se guardan todos los cambios?? -- tiene que ir todo en la misma linea!!
#df_col_1 = df.rename(columns={'DailyRate': 'daily_rate'})
#df_col_1= df.rename(columns={"Age":"age"})
#df_col_1

In [ ]:
#ver la info de las columnas
df_col_1.info()

In [22]:
#codigo de Marga para limpiar los nombres de la columnaas
colum_limpias=[]
for columna in df_col_1:
    patron='[A-Z][^A-Z]*'
    columna_limpia=re.findall(patron,columna)
    columna_limpia1='_'.join(columna_limpia)
    columna_min=columna_limpia1.lower()
    colum_limpias.append(columna_min)
df_col_1= colum_limpias
df_col_1

['unnamed: 0',
 'age',
 'attrition',
 'business_travel',
 'daily_rate',
 'department',
 'distance_from_home',
 'education',
 'education_field',
 '',
 '']

In [26]:
#Valores unicos
print(df["Age"].unique())

['51' '52' '42' '47' '46' '48' '59' '41' '56' '38' '55' '40' '58' '35'
 '45' '33' '36' '34' 'forty-seven' '53' '43' '60' '32' '37' '49' '39' '50'
 '44' '30' 'fifty-eight' '29' '31' '54' '57' '27' 'thirty-six' '28' '26'
 'fifty-five' '25' 'fifty-two' 'thirty-one' '24' 'thirty' '23' '22' '21'
 '20' 'twenty-six' '19' 'thirty-seven' '18' 'thirty-two' 'twenty-four']

In [9]:
#creamos un diccionario paara la colimna "age"ArithmeticError
valores = {
    "forty-seven": 47,
    "fifty-eight": 58,
    "thirty-six": 36,
    "fifty-five": 55,
    "fifty-two": 52,
    "thirty-one": 31,
    "thirty": 30,
    "twenty-six": 26,
    "thirty-seven": 37,
    "thirty-two": 32,
    "twenty-four": 24
}
df_col_1['Age'] = df_col_1['Age'].replace(valores)
df_col_1["Age"].unique()

array(['51', '52', '42', '47', '46', '48', '59', '41', '56', '38', '55',
       '40', '58', '35', '45', '33', '36', '34', 47, '53', '43', '60',
       '32', '37', '49', '39', '50', '44', '30', 58, '29', '31', '54',
       '57', '27', 36, '28', '26', 55, '25', 52, 31, '24', 30, '23', '22',
       '21', '20', 26, '19', 37, '18', 32, 24], dtype=object)

In [11]:
#pasamos de object a int
df_col_1['Age'] = df_col_1['Age'].astype(int)

In [13]:
#columna Attrition
#primero hay que convertir todos los valores a string ( no todos lo son)
df_col_1["Attrition"] = df_col_1["Attrition"].astype(str)
# pasamos de object a booleanos 
df_col_1["Attrition"] = df_col_1["Attrition"].str.lower().map({'true': True, 'false': False, 'yes': True, 'no': False})

In [ ]:
#columna BusinessTravel
#yo diria que esta bien

In [14]:
#columna DailyRate
#quitamos $
df_col_1['DailyRate'] = df_col_1['DailyRate'].str.replace('$', '')
df_col_1['DailyRate'].unique()

/var/folders/xq/csbbd0r51pv6ssy_frd0mmcr0000gn/T/ipykernel_35418/1697622961.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_col_1['DailyRate'] = df_col_1['DailyRate'].str.replace('$', '')

array(['684,0', '699,0', '532,0', '359,0', '1319,0', '117,0', '1435,0',
       '635,0', '1276,0', '840,0', '247,0', '1369,0', '201,0', '1360,0',
       '692,0', '1398,0', '286,0', '1402,0', '819,0', '884,0', '1238,0',
       '515,0', '1223,0', '202,0', '928,0', '607,0', '266,0', '429,0',
       '589,0', 'nan', '1180,0', '1282,0', '776,0', '665,0', '526,0',
       '1034,0', '1403,0', '1499,0', '580,0', '859,0', '263,0', '1376,0',
       '885,0', '1003,0', '1321,0', '394,0', '1372,0', '1333,0', '228,0',
       '737,0', '823,0', '667,0', '301,0', '573,0', '1329,0', '630,0',
       '1063,0', '1017,0', '1296,0', '939,0', '1355,0', '1448,0', '200,0',
       '1202,0', '404,0', '208,0', '813,0', '465,0', '1189,0', '1001,0',
       '1394,0', '161,0', '288,0', '682,0', '1354,0', '147,0', '119,0',
       '1413,0', '452,0', '334,0', '1132,0', '982,0', '480,0', '1099,0',
       '672,0', '1379,0', '583,0', '1492,0', '1050,0', '469,0', '237,0',
       '1440,0', '1291,0', '1157,0', '1336,0', '1224,0', '735,0',
       '1389,0', '638,0', '1240,0', '194,0', '1339,0', '111,0', '1469,0',
       '470,0', '1232,0', '1249,0', '798,0', '549,0', '570,0', '541,0',
       '164,0', '1117,0', '619,0', '319,0', '956,0', '1245,0', '1397,0',
       '527,0', '213,0', '882,0', '330,0', '406,0', '217,0', '481,0',
       '669,0', '1465,0', '685,0', '1062,0', '177,0', '1199,0', '648,0',
       '412,0', '282,0', '770,0', '601,0', '855,0', '332,0', '1326,0',
       '748,0', '405,0', '790,0', '971,0', '1370,0', '750,0', '880,0',
       '678,0', '1179,0', '350,0', '1266,0', '574,0', '189,0', '310,0',
       '722,0', '1219,0', '994,0', '721,0', '853,0', '427,0', '852,0',
       '1334,0', '1093,0', '967,0', '989,0', '1195,0', '1045,0', '829,0',
       '663,0', '1300,0', '1105,0', '906,0', '849,0', '1275,0', '1218,0',
       '422,0', '1274,0', '1076,0', '1207,0', '430,0', '933,0', '1184,0',
       '586,0', '890,0', '379,0', '1425,0', '1188,0', '938,0', '1053,0',
       '248,0', '796,0', '174,0', '408,0', '977,0', '536,0', '135,0',
       '1476,0', '587,0', '495,0', '523,0', '507,0', '1055,0', '1445,0',
       '218,0', '447,0', '1029,0', '674,0', '538,0', '740,0', '1234,0',
       '170,0', '1130,0', '584,0', '918,0', '792,0', '611,0', '1383,0',
       '867,0', '706,0', '728,0', '311,0', '556,0', '937,0', '1125,0',
       '444,0', '911,0', '585,0', '1392,0', '1005,0', '1299,0', '655,0',
       '746,0', '632,0', '658,0', '1467,0', '1312,0', '249,0', '802,0',
       '689,0', '1395,0', '1436,0', '1496,0', '1480,0', '313,0', '894,0',
       '290,0', '1084,0', '1002,0', '1242,0', '1052,0', '944,0', '771,0',
       '1416,0', '1327,0', '488,0', '1385,0', '666,0', '1315,0', '442,0',
       '950,0', '691,0', '1018,0', '559,0', '318,0', '144,0', '1171,0',
       '143,0', '1178,0', '1107,0', '645,0', '1485,0', '1116,0', '163,0',
       '561,0', '426,0', '509,0', '258,0', '525,0', '238,0', '482,0',
       '397,0', '243,0', '806,0', '1442,0', '929,0', '827,0', '703,0',
       '294,0', '314,0', '654,0', '501,0', '954,0', '1434,0', '657,0',
       '240,0', '791,0', '676,0', '436,0', '760,0', '661,0', '1085,0',
       '154,0', '1283,0', '616,0', '498,0', '530,0', '805,0', '903,0',
       '1229,0', '566,0', '1441,0', '153,0', '1066,0', '145,0', '1109,0',
       '124,0', '300,0', '1366,0', '857,0', '1204,0', '1082,0', '203,0',
       '1308,0', '718,0', '593,0', '1384,0', '1361,0', '1146,0', '1316,0',
       '363,0', '1103,0', '920,0', '694,0', '1429,0', '531,0', '621,0',
       '604,0', '325,0', '1030,0', '524,0', '943,0', '1009,0', '817,0',
       '930,0', '1147,0', '652,0', '337,0', '1136,0', '326,0', '377,0',
       '1038,0', '1490,0', '1246,0', '224,0', '441,0', '898,0', '1313,0',
       '1015,0', '1387,0', '1302,0', '602,0', '772,0', '809,0', '786,0',
       '921,0', '717,0', '979,0', '953,0', '244,0', '196,0', '303,0',
       '1092,0', '261,0', '1422,0', '1137,0', '511,0', '1396,0', '1096,0',
       '1169,0', '1239,0', '157,0', '754,0', '1303,0', '697,0', '116,0',
       '557,0', '582,0', '704,0', '613,0', '419,0', '477,0', '1211,0',
       '505,0', '269,0', '553,0', '1277,0', '302,0', '975,0', '1318,0',
       '881,0', '466,0', '945,0', '433,0', '991,0', '1083,0', '136,0',
       '333,0', '1462,0', '1131,0', '1023,0', '1065,0', '1115,0',
       '1479,0', '304,0', '1368,0', '828,0', '799,0', '142,0', '446,0',
       '254,0', '1410,0', '883,0', '121,0', '1343,0', '490,0', '1400,0',
       '1332,0', '1200,0', '1102,0', '1328,0', '548,0', '1214,0', '120,0',
       '841,0', '1033,0', '1452,0', '1268,0', '307,0', '797,0', '555,0',
       '1377,0', '210,0', '483,0', '575,0', '1311,0', '759,0', '891,0',
       '317,0', '688,0', '195,0', '622,0', '646,0', '719,0', '1012,0',
       '1278,0', '1222,0', '1231,0', '462,0', '231,0', '1089,0', '1262,0',
       '439,0', '528,0', '647,0', '1097,0', '942,0', '966,0', '168,0',
       '299,0', '999,0', '1498,0', '1439,0', '1111,0', '1174,0', '172,0',
       '401,0', '866,0', '571,0', '1342,0', '995,0', '118,0', '990,0',
       '241,0', '1470,0', '492,0', '1040,0', '1320,0', '146,0', '1153,0',
       '185,0', '1297,0', '1064,0', '1351,0', '468,0', '1273,0', '1141,0',
       '1488,0', '653,0', '1225,0', '1217,0', '1127,0', '1427,0', '702,0',
       '926,0', '878,0', '896,0', '1401,0', '675,0', '1070,0', '496,0',
       '390,0', '1220,0', '1124,0', '1046,0', '267,0', '443,0', '1287,0',
       '1420,0', '562,0', '650,0', '141,0', '715,0', '376,0', '932,0',
       '471,0', '180,0', '1265,0', '1075,0', '1086,0', '152,0', '974,0',
       '788,0', '192,0', '150,0', '1167,0', '206,0', '736,0', '322,0',
       '683,0', '1475,0', '560,0', '115,0', '888,0', '671,0', '567,0',
       '148,0', '581,0', '371,0', '1181,0', '1253,0', '370,0', '1194,0',
       '572,0', '355,0', '783,0', '155,0', '508,0', '642,0', '1382,0',
       '1037,0', '1120,0', '374,0', '287,0', '591,0', '670,0', '1346,0',
       '103,0', '673,0', '705,0', '1459,0', '1443,0', '1142,0', '664,0',
       '432,0', '1353,0', '489,0', '807,0', '1280,0', '957,0', '542,0',
       '216,0', '1150,0', '364,0', '1256,0', '440,0', '713,0', '140,0',
       '629,0', '328,0', '472,0', '905,0', '1151,0', '644,0', '992,0',
       '1323,0', '818,0', '1431,0', '976,0', '832,0', '916,0', '1247,0',
       '128,0', '1158,0', '996,0', '1449,0', '636,0', '889,0', '106,0',
       '723,0', '1482,0', '738,0', '1192,0', '1309,0', '544,0', '641,0',
       '756,0', '895,0', '1261,0', '329,0', '1362,0', '1371,0', '821,0',
       '1381,0', '1473,0', '296,0', '1349,0', '986,0', '413,0', '988,0',
       '1474,0', '232,0', '1236,0', '1112,0', '204,0', '913,0', '810,0',
       '693,0', '316,0', '381,0', '775,0', '804,0', '1090,0', '346,0',
       '725,0', '182,0', '384,0', '1325,0', '1258,0', '1041,0', '625,0',
       '1418,0', '1269,0', '395,0', '341,0', '500,0', '1454,0', '617,0',
       '1122,0', '1198,0', '188,0', '335,0', '461,0', '1134,0', '138,0',
       '1206,0', '109,0', '277,0', '265,0', '342,0', '1186,0', '769,0',
       '1176,0', '1091,0', '618,0', '970,0', '984,0', '793,0', '1182,0',
       '603,0', '874,0', '367,0', '199,0', '1457,0', '1421,0', '1450,0',
       '1212,0', '1010,0', '131,0', '193,0', '640,0', '848,0', '1138,0',
       '256,0', '935,0', '458,0', '662,0', '499,0', '949,0', '383,0',
       '1255,0', '1221,0', '981,0', '1495,0', '1193,0', '467,0', '271,0',
       '410,0', '1288,0', '1108,0', '437,0', '457,0', '634,0', '546,0',
       '711,0', '448,0', '365,0', '763,0', '486,0', '392,0', '727,0',
       '741,0', '552,0', '506,0', '1456,0', '160,0', '897,0', '600,0',
       '1054,0', '428,0', '343,0', '1216,0', '207,0', '280,0', '414,0',
       '836,0', '592,0', '219,0', '1079,0', '1251,0', '1168,0', '1444,0',
       '1154,0', '234,0', '529,0', '1322,0', '924,0', '134,0', '755,0',
       '253,0', '922,0', '1365,0', '306,0', '1271,0', '1404,0', '1391,0',
       '1464,0', '1330,0', '773,0', '902,0', '107,0', '504,0', '1358,0',
       '824,0', '594,0', '734,0', '766,0', '431,0', '1213,0', '1373,0',
       '1324,0', '1123,0', '391,0', '125,0', '1357,0', '626,0', '132,0',
       '871,0', '1031,0', '1145,0', '854,0', '1411,0', '252,0', '833,0',
       '1210,0', '1463,0', '812,0', '1162,0', '845,0', '1144,0', '156,0',
       '464,0', '1305,0', '983,0', '534,0', '1306,0', '1094,0', '558,0',
       '959,0', '782,0', '362,0', '268,0', '167,0', '1243,0', '720,0',
       '868,0', '1252,0', '781,0', '1272,0', '129,0', '1069,0', '289,0',
       '955,0', '660,0', '415,0', '309,0', '130,0', '862,0', '1098,0',
       '969,0', '373,0', '599,0', '968,0', '830,0', '1423,0', '516,0',
       '598,0', '104,0', '479,0', '474,0', '264,0', '1059,0', '563,0',
       '1259,0', '369,0', '543,0', '964,0', '176,0', '181,0', '211,0',
       '590,0', '305,0', '478,0', '1294,0', '1128,0', '726,0', '352,0',
       '1172,0', '605,0', '1337,0', '105,0'], dtype=object)

In [15]:
# ahora reemplazar las comas por puntos en la columna DailyRate
df_col_1['DailyRate'] = df_col_1['DailyRate'].str.replace(',', '.')

# Convertir la columna a tipo float
df_col_1['DailyRate'] = df_col_1['DailyRate'].astype(float)
# si da error es porque ya estaba ejecutado, pero esta bien

In [ ]:
df_col_1['DailyRate'].info

In [ ]:
#columna Department
# yo diria que esta columna esta bien

In [17]:
# columna DistanceFromHome
# Filtrar los valores positivos
valores_positivos = df_col_1[df_col_1['DistanceFromHome'] > 0]['DistanceFromHome']

# Calcular la mediana de los valores positivos
mediana_positivos = DistanceFromHome_positivos.median()

# Sustituir los valores negativos con la mediana calculada
df_col_1['DistanceFromHome'] = df['DistanceFromHome'].apply(lambda x: mediana_positivos if x < 0 else x)

print(df_col_1)

NameError: name 'DistanceFromHome_positivos' is not defined

In [ ]:
# columna Education
# es inter y esta bien.

In [19]:
#columna EducationField
# 1. Eliminar valores nulos
df_col_1['EducationField'].dropna(inplace=True)

# 2. Quitar espacios en blanco adicionales
df_col_1['EducationField'] = df_col_1['EducationField'].str.strip()

# 3. Reemplazar comillas y otros caracteres especiales si es necesario
df_col_1['EducationField'] = df_col_1['EducationField'].str.replace("'", "")  # Eliminar comillas
# Si hay otros caracteres especiales, puedes utilizar .replace() de manera similar

# 4. Verificar y corregir errores tipográficos
# Por ejemplo, si hay variaciones en la capitalización
df_col_1['EducationField'] = df_col_1['EducationField'].str.capitalize()  # Convertir la primera letra a mayúscula

# Verificar los valores únicos después de la limpieza
df_col_1['EducationField'].unique()

array([nan, 'Life sciences', 'Technical degree', 'Medical', 'Other',
       'Marketing', 'Human resources'], dtype=object)

In [ ]:
#columna employeecount
# esta bien

In [20]:
#columna employeenumber
#pasarlo de object a int 
# Limpiar la columna eliminando la coma
df_col_1['employeenumber'] = df_col_1['employeenumber'].str.replace(',', '')

In [21]:
df_col_1['employeenumber']

0       1620
1       2590
2       3190
3        NaN
4        NaN
        ...
1609    9670
1610    9720
1611     NaN
1612    9900
1613     NaN
Name: employeenumber, Length: 1614, dtype: object